MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NANO112VC2AN/mcu.h
#define ACMP_CR_CN_Pos                 (4)                                                 /*!< ACMP_T::CR: CN Position                 */
#define ACMP_CR_CN_Msk                 (0x3ul << ACMP_CR_CN_Pos)                           /*!< ACMP_T::CR: CN Mask                     */

#define ACMP_CR_ACMP0_EX_Pos            (16)                                               /*!< ACMP_T::CR: ACMP0_EX Position            */
#define ACMP_CR_ACMP0_EX_Msk            (0x1ul << ACMP_CR_ACMP0_EX_Pos)                    /*!< ACMP_T::CR: ACMP0_EX Mask                */

#define ACMP_CR_ACMP0_INV_Pos           (17)                                               /*!< ACMP_T::CR: ACMP0_INV  Position */
#define ACMP_CR_ACMP0_INV_Msk           (0x1UL<<ACMP_CR_ACMP0_INV_Pos)                     /*!< ACMP_T::CR: ACMP0_INV  Mask */

#define ACMP_CR_ACOMP0_PN_AutoEx_Pos    (19)                                               /*!< ACMP_T::CR: ACOMP0_PN_AutoEx Position    */
#define ACMP_CR_ACOMP0_PN_AutoEx_Msk    (0x1ul << ACMP_CR_ACOMP0_PN_AutoEx_Pos)            /*!< ACMP_T::CR: ACOMP0_PN_AutoEx Mask        */

#define ACMP_CR_ACMP0_FILTER_Pos        (20)                                               /*!< ACMP_T::CR: ACMP0_FILTER Position        */
#define ACMP_CR_ACMP0_FILTER_Msk        (0x1ul << ACMP_CR_ACMP0_FILTER_Pos)                /*!< ACMP_T::CR: ACMP0_FILTER Mask            */

#define ACMP_CR_CPO0_SEL_Pos            (21)                                               /*!< ACMP_T::CR: CPO0_SEL Position            */
#define ACMP_CR_CPO0_SEL_Msk            (0x1ul << ACMP_CR_CPO0_SEL_Pos)                    /*!< ACMP_T::CR: CPO0_SEL Mask                */

#define ACMP_CR_CPP0SEL_Pos             (29)                                               /*!< ACMP_T::CR: CPP0SEL Position             */
#define ACMP_CR_CPP0SEL_Msk             (0x3ul << ACMP_CR_CPP0SEL_Pos)                     /*!< ACMP_T::CR: CPP0SEL Mask                 */

#define ACMP_CR_ACMP_WKEUP_EN_Pos        (31)                                              /*!< ACMP_T::CR: ACMP0_WKEUP_EN Position      */
#define ACMP_CR_ACMP_WKEUP_EN_Msk        (0x1ul << ACMP_CR_ACMP0_WKEUP_EN_Pos)             /*!< ACMP_T::CR: ACMP0_WKEUP_EN Mask          */

#define ACMP_SR_ACMPF0_Pos               (0)                                               /*!< ACMP_T::SR: ACMPF0 Position               */
#define ACMP_SR_ACMPF0_Msk               (0x1ul << ACMP_SR_ACMPF0_Pos)                     /*!< ACMP_T::SR: ACMPF0 Mask                   */

#define ACMP_SR_ACMPF1_Pos               (1)                                               /*!< ACMP_T::SR: ACMPF1 Position               */
#define ACMP_SR_ACMPF1_Msk               (0x1ul << ACMP_SR_ACMPF1_Pos)                     /*!< ACMP_T::SR: ACMPF1 Mask                   */

#define ACMP_SR_CO0_Pos                  (2)                                               /*!< ACMP_T::SR: CO0 Position                  */
#define ACMP_SR_CO0_Msk                  (0x1ul << ACMP_SR_CO0_Pos)                        /*!< ACMP_T::SR: CO0 Mask                      */

#define ACMP_SR_CO1_Pos                  (3)                                               /*!< ACMP_T::SR: CO1 Position                  */
#define ACMP_SR_CO1_Msk                  (0x1ul << ACMP_SR_CO1_Pos)                        /*!< ACMP_T::SR: CO1 Mask                      */

#define ACMP_RVCR_CRVS_Pos               (0)                                               /*!< ACMP_T::RVCR: CRVS Position               */
#define ACMP_RVCR_CRVS_Msk               (0xful << ACMP_RVCR_CRVS_Pos)                     /*!< ACMP_T::RVCR: CRVS Mask                   */

#define ACMP_RVCR_CRV_EN_Pos             (4)                                               /*!< ACMP_T::RVCR: CRV_EN Position             */
#define ACMP_RVCR_CRV_EN_Msk             (0x1ul << ACMP_RVCR_CRV_EN_Pos)                   /*!< ACMP_T::RVCR: CRV_EN Mask                 */

#define ACMP_RVCR_CRVSRC_SEL_Pos         (5)                                               /*!< ACMP_T::RVCR: CRVSRC_SEL Position         */
#define ACMP_RVCR_CRVSRC_SEL_Msk         (0x1ul << ACMP_RVCR_CRVSRC_SEL_Pos)               /*!< ACMP_T::RVCR: CRVSRC_SEL Mask             */

#define ACMP_MODCR0_MOD_SEL_Pos          (0)                                               /*!< ACMP_T::MODCR0: MOD_SEL Position          */
#define ACMP_MODCR0_MOD_SEL_Msk          (0x3ul << ACMP_MODCR0_MOD_SEL_Pos)                /*!< ACMP_T::MODCR0: MOD_SEL Mask              */

#define ACMP_MODCR0_TMR_SEL_Pos          (2)                                               /*!< ACMP_T::MODCR0: TMR_SEL Position          */
#define ACMP_MODCR0_TMR_SEL_Msk          (0x1ul << ACMP_MODCR0_TMR_SEL_Pos)                /*!< ACMP_T::MODCR0: TMR_SEL Mask              */

#define ACMP_MODCR0_TMR_TRI_LV_Pos       (3)                                               /*!< ACMP_T::MODCR0: TMR_TRI_LV Position       */
#define ACMP_MODCR0_TMR_TRI_LV_Msk       (0x1ul << ACMP_MODCR0_TMR_TRI_LV_Pos)             /*!< ACMP_T::MODCR0: TMR_TRI_LV Mask           */

#define ACMP_MODCR0_CH_DIS_PIN_SEL_Pos   (4)                                               /*!< ACMP_T::MODCR0: CH_DIS_PIN_SEL Position   */
#define ACMP_MODCR0_CH_DIS_PIN_SEL_Msk   (0x7ul << ACMP_MODCR0_CH_DIS_PIN_SEL_Pos)         /*!< ACMP_T::MODCR0: CH_DIS_PIN_SEL Mask       */

#define ACMP_MODCR0_CH_DIS_FUN_SEL_Pos   (7)                                               /*!< ACMP_T::MODCR0: CH_DIS_FUN_SEL Position   */
#define ACMP_MODCR0_CH_DIS_FUN_SEL_Msk   (0x1ul << ACMP_MODCR0_CH_DIS_FUN_SEL_Pos)         /*!< ACMP_T::MODCR0: CH_DIS_FUN_SEL Mask       */

#define ACMP_MODCR0_START_Pos            (8)                                               /*!< ACMP_T::MODCR0: START Position            */
#define ACMP_MODCR0_START_Msk            (0x1ul << ACMP_MODCR0_START_Pos)                  /*!< ACMP_T::MODCR0: START Mask                */

/**@}*/ /* ACMP_CONST */
/**@}*/ /* end of ACMP register group */


/*---------------------- Analog to Digital Converter -------------------------*/
/**
    @addtogroup ADC Analog to Digital Converter(ADC)
    Memory Mapped Structure for ADC Controller
@{ */

typedef struct
{


    /**
     * RESULT
     * ===================================================================================================
     * Offset: 0x00 ~ 0x44 A/D Data Register 0 ~ 7 and 14 ~ 17
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[11:0]  |RSLT      |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion results.
     * |[16]    |VALID     |Data Valid Flag
     * |        |          |After ADC converts finish, this field will set to high.
     * |        |          |This field will clear when this register be read.
     * |[17]    |OVERRUN   |Over Run Flag
     * |        |          |When VALID is high and ADC converts finish, this field will set to high.
    */
    __I  uint32_t RESULT[18];


    /**
     * CR
     * ===================================================================================================
     * Offset: 0x48  A/D Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADEN      |A/D Converter Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |        |          |Before starting A/D conversion, this bit should be set to 1.
     * |        |          |Clear it to 0 to disable A/D converter analog circuit power consumption.
     * |[1]     |ADIE      |A/D Interrupt Enable
     * |        |          |0 = A/D interrupt function Disabled.
     * |        |          |1 = A/D interrupt function Enabled.
     * |        |          |A/D conversion end interrupt request is generated if ADIE bit is set to 1.
     * |[3:2]   |ADMD      |A/D Converter Operation Mode
     * |        |          |00 = Single conversion
     * |        |          |01 = Reserved
     * |        |          |10 = Single-cycle scan
     * |        |          |11 = Continuous scan
     * |[5:4]   |TRGS      |Hardware Trigger Source
     * |        |          |This field must keep 00
     * |        |          |Software should disable TRGE and ADST before change TRGS.
     * |        |          |In hardware trigger mode, the ADST bit is set by the external trigger from STADC, However software has the highest priority to set or cleared ADST bit at any time.
     * |[7:6]   |TRGCOND   |External Trigger Condition
     * |        |          |These two bits decide external pin STADC trigger event is level or edge.
     * |        |          |The signal must be kept at stable state at least 8 PCLKs for level trigger and 4 PCLKs at high and low state.
     * |        |          |00 = Low level
     * |        |          |01 = High level
     * |        |          |10 = Falling edge
     * |        |          |11 = Rising edge
     * |[8]     |TRGE      |External Trigger Enable
     * |        |          |Enable or disable triggering of A/D conversion by external STADC pin.
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[9]     |PTEN      |PDMA Transfer Enable
     * |        |          |0 = PDMA data transfer Disabled.
     * |        |          |1 = PDMA data transfer in ADC_RESULT 0~17 Enabled.
     * |        |          |When A/D conversion is completed, the converted data is loaded into ADC_RESULT 0~10, software can enable this bit to generate a PDMA data transfer request.
     * |        |          |When PTEN=1, software must set ADIE=0 to disable interrupt.
     * |        |          |PDMA can access ADC_RESULT 0-17 registers by block or single transfer mode.
     * |[10]    |DIFF      |Differential Mode Selection
     * |        |          |0 = ADC is operated in single-ended mode.
     * |        |          |1 = ADC is operated in differential mode.
     * |        |          |The A/D analog input ADC_CH0/ADC_CH1 consists of a differential pair.
     * |        |          |So as ADC_CH2/ADC_CH3, ADC_CH4/ADC_CH5, ADC_CH6/ADC_CH7, ADC_CH8/ADC_CH9 and ADC_CH10/ADC_CH11.
     * |        |          |The even channel defines as plus analog input voltage (Vplus) and the odd channel defines as minus analog input voltage (Vminus).
     * |        |          |Differential input voltage (Vdiff) = Vplus - Vminus, where Vplus is the analog input; Vminus is the inverted analog input.
     * |        |          |In differential input mode, only the even number of the two corresponding channels needs to be enabled in CHEN (ADCHER[11:0]).
     * |        |          |The conversion result will be placed to the corresponding data register of the enabled channel.
     * |        |          |Note: Calibration should calibrated each time when switching between single-ended and differential mode
     * |[11]    |ADST      |A/D Conversion Start
     * |        |          |0 = Conversion stopped and A/D converter enter idle state.
     * |        |          |1 = Conversion starts.
     * |        |          |ADST bit can be set to 1 from two sources: software write and external pin STADC.
     * |        |          |ADST is cleared to 0 by hardware automatically at the end of single mode and single-cycle scan mode on specified channels.
     * |        |          |In continuous scan mode, A/D conversion is continuously performed sequentially unless software writes 0 to this bit or chip reset.
     * |        |          |Note: After ADC conversion done, SW needs to wait at least one ADC clock before to set this bit high again.
     * |[13:12] |TMSEL     |Select A/D Enable Time-Out Source
     * |        |          |00 = TMR0
     * |        |          |01 = TMR1
     * |        |          |10 = TMR2
     * |        |          |11 = TMR3
     * |[15]    |TMTRGMOD  |Timer Event Trigger ADC Conversion
     * |        |          |0 = This function Disabled.
     * |        |          |1 = ADC Enabled by TIMER OUT event. Setting TMSEL to select timer event from timer0~3
     * |[17:16] |REFSEL    |Reference Voltage Source Selection
     * |        |          |00 = Reserved
     * |        |          |01 = Select Int_VREF as reference voltage
     * |        |          |10 = Select VREF as reference voltage
     * |        |          |11 = Reserved
     * |[19:18] |RESSEL    |Resolution Selection
     * |        |          |00 = 6 bits
     * |        |          |01 = 8 bits
     * |        |          |10 = 10 bits
     * |        |          |11 = 12 bits
     * |[31:24] |TMPDMACNT |PDMA Count
     * |        |          |When each timer event occur PDMA will transfer TMPDMACNT +1 ADC result in the amount of this register setting
     * |        |          |Note: The total amount of PDMA transferring data should be set in PDMA byte count register.
     * |        |          |When PDMA finish is set, ADC will not be enabled and start transfer even though the timer event occurred.
    */
    __IO uint32_t CR;

    /**
     * CHEN
     * ===================================================================================================
     * Offset: 0x4C  A/D Channel Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CHEN0     |Analog Input Channel 0 Enable Control (Convert Input Voltage From PA.0 )
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |        |          |If more than one channel in single mode is enabled by software, the least channel is converted and other enabled channels will be ignored.
     * |[1]     |CHEN1     |Analog Input Channel 1 Enable Control (Convert Input Voltage From PA.1 )
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[2]     |CHEN2     |Analog Input Channel 2 Enable Control (Convert Input Voltage From PA.2 )
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[3]     |CHEN3     |Analog Input Channel 3 Enable Control (Convert Input Voltage From PA.3 )
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[4]     |CHEN4     |Analog Input Channel 4 Enable Control (Convert Input Voltage From PA.4 )
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[5]     |CHEN5     |Analog Input Channel 5 Enable Control (Convert Input Voltage From PA.5 )
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[6]     |CHEN6     |Analog Input Channel 6 Enable Control (Convert Input Voltage From PA.6 )
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[7]     |CHEN7     |Analog Input Channel 7 Enable Control (Convert Input Voltage From PA.7 )
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[14]    |CHEN14    |Analog Input Channel 14 Enable Control (Convert VTEMP)
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[15]    |CHEN15    |Analog Input Channel 15 Enable Control (Convert Int_VREF)
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[16]    |CHEN16    |Analog Input Channel 16 Enable Control (Convert AVDD)
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[17]    |CHEN17    |Analog Input Channel 17 Enable Control (Convert AVSS)
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
    */
    __IO uint32_t CHEN;

    /**
     * CMPR0
     * ===================================================================================================
     * Offset: 0x50  A/D Compare Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CMPEN     |Compare Enable
     * |        |          |0 = Compare Disabled.
     * |        |          |1 = Compare Enabled.
     * |        |          |Set this bit to 1 to enable compare CMPD[11:0] with specified channel conversion result when converted data is loaded into ADC_RESULTx register.
     * |        |          |When this bit is set to 1, and CMPMATCNT is 0, the CMPF will be set once the match is hit
     * |[1]     |CMPIE     |Compare Interrupt Enable
     * |        |          |0 = Compare function interrupt Disabled.
     * |        |          |1 = Compare function interrupt Enabled.
     * |        |          |If the compare function is enabled and the compare condition matches the setting of CMPCOND and CMPMATCNT, CMPF bit will be asserted, in the meanwhile, if CMPIE is set to 1, a compare interrupt request is generated.
     * |[2]     |CMPCOND   |Compare Condition
     * |        |          |0 = Set the compare condition as that when a 12-bit A/D conversion result is less than the 12-bit CMPD (ADCMPRx[27:16]), the internal match counter will increase one.
     * |        |          |1 = Set the compare condition as that when a 12-bit A/D conversion result is greater or equal to the 12-bit CMPD (ADCMPRx[27:16]), the internal match counter will increase by one.
     * |        |          |Note: When the internal counter reaches the value to (CMPMATCNT +1), the CMPF bit will be set.
     * |[7:3]   |CMPCH     |Compare Channel Selection
     * |        |          |This field selects the channel whose conversion result is selected to be compared.
     * |[11:8]  |CMPMATCNT |Compare Match Count
     * |        |          |When the specified A/D channel analog conversion result matches the compare condition defined by CMPCOND[2], the internal match counter will increase 1.
     * |        |          |When the internal counter reaches the value to (CMPMATCNT +1), the CMPF bit will be set.
     * |[27:16] |CMPD      |Comparison Data
     * |        |          |The 12 bits data is used to compare with conversion result of specified channel.
     * |        |          |Software can use it to monitor the external analog input pin voltage variation in scan mode without imposing a load on software.
    */
    __IO uint32_t CMPR0;

    /**
     * CMPR1
     * ===================================================================================================
     * Offset: 0x54  A/D Compare Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CMPEN     |Compare Enable
     * |        |          |0 = Compare Disabled.
     * |        |          |1 = Compare Enabled.
     * |        |          |Set this bit to 1 to enable compare CMPD[11:0] with specified channel conversion result when converted data is loaded into ADC_RESULTx register.
     * |        |          |When this bit is set to 1, and CMPMATCNT is 0, the CMPF will be set once the match is hit
     * |[1]     |CMPIE     |Compare Interrupt Enable
     * |        |          |0 = Compare function interrupt Disabled.
     * |        |          |1 = Compare function interrupt Enabled.
     * |        |          |If the compare function is enabled and the compare condition matches the setting of CMPCOND and CMPMATCNT, CMPF bit will be asserted, in the meanwhile, if CMPIE is set to 1, a compare interrupt request is generated.
     * |[2]     |CMPCOND   |Compare Condition
     * |        |          |0 = Set the compare condition as that when a 12-bit A/D conversion result is less than the 12-bit CMPD (ADCMPRx[27:16]), the internal match counter will increase one.
     * |        |          |1 = Set the compare condition as that when a 12-bit A/D conversion result is greater or equal to the 12-bit CMPD (ADCMPRx[27:16]), the internal match counter will increase by one.
     * |        |          |Note: When the internal counter reaches the value to (CMPMATCNT +1), the CMPF bit will be set.
     * |[7:3]   |CMPCH     |Compare Channel Selection
     * |        |          |This field selects the channel whose conversion result is selected to be compared.
     * |[11:8]  |CMPMATCNT |Compare Match Count
     * |        |          |When the specified A/D channel analog conversion result matches the compare condition defined by CMPCOND[2], the internal match counter will increase 1.
     * |        |          |When the internal counter reaches the value to (CMPMATCNT +1), the CMPF bit will be set.
     * |[27:16] |CMPD      |Comparison Data
     * |        |          |The 12 bits data is used to compare with conversion result of specified channel.
     * |        |          |Software can use it to monitor the external analog input pin voltage variation in scan mode without imposing a load on software.
    */
    __IO uint32_t CMPR1;

