MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NANO112VC2AN/mcu.h
#define PWM_CRL0_CRL_Pos                 (0)                                               /*!< PWM_T::CRL0: CRL Position                 */
#define PWM_CRL0_CRL_Msk                 (0xfffful << PWM_CRL0_CRL_Pos)                    /*!< PWM_T::CRL0: CRL Mask                     */

#define PWM_CRL0_CRL_H_Pos               (16)                                              /*!< PWM_T::CRL0: CRL_H Position               */
#define PWM_CRL0_CRL_H_Msk               (0xfffful << PWM_CRL0_CRL_H_Pos)                  /*!< PWM_T::CRL0: CRL_H Mask                   */

#define PWM_CFL0_CFL_Pos                 (0)                                               /*!< PWM_T::CFL0: CFL Position                 */
#define PWM_CFL0_CFL_Msk                 (0xfffful << PWM_CFL0_CFL_Pos)                    /*!< PWM_T::CFL0: CFL Mask                     */

#define PWM_CFL0_CFL_H_Pos               (16)                                              /*!< PWM_T::CFL0: CFL_H Position               */
#define PWM_CFL0_CFL_H_Msk               (0xfffful << PWM_CFL0_CFL_H_Pos)                  /*!< PWM_T::CFL0: CFL_H Mask                   */

#define PWM_CRL1_CRL_Pos                 (0)                                               /*!< PWM_T::CRL1: CRL Position                 */
#define PWM_CRL1_CRL_Msk                 (0xfffful << PWM_CRL1_CRL_Pos)                    /*!< PWM_T::CRL1: CRL Mask                     */

#define PWM_CRL1_CRL_H_Pos               (16)                                              /*!< PWM_T::CRL1: CRL_H Position               */
#define PWM_CRL1_CRL_H_Msk               (0xfffful << PWM_CRL1_CRL_H_Pos)                  /*!< PWM_T::CRL1: CRL_H Mask                   */

#define PWM_CFL1_CFL_Pos                 (0)                                               /*!< PWM_T::CFL1: CFL Position                 */
#define PWM_CFL1_CFL_Msk                 (0xfffful << PWM_CFL1_CFL_Pos)                    /*!< PWM_T::CFL1: CFL Mask                     */

#define PWM_CFL1_CFL_H_Pos               (16)                                              /*!< PWM_T::CFL1: CFL_H Position               */
#define PWM_CFL1_CFL_H_Msk               (0xfffful << PWM_CFL1_CFL_H_Pos)                  /*!< PWM_T::CFL1: CFL_H Mask                   */

#define PWM_CRL2_CRL_Pos                 (0)                                               /*!< PWM_T::CRL2: CRL Position                 */
#define PWM_CRL2_CRL_Msk                 (0xfffful << PWM_CRL2_CRL_Pos)                    /*!< PWM_T::CRL2: CRL Mask                     */

#define PWM_CRL2_CRL_H_Pos               (16)                                              /*!< PWM_T::CRL2: CRL_H Position               */
#define PWM_CRL2_CRL_H_Msk               (0xfffful << PWM_CRL2_CRL_H_Pos)                  /*!< PWM_T::CRL2: CRL_H Mask                   */

#define PWM_CFL2_CFL_Pos                 (0)                                               /*!< PWM_T::CFL2: CFL Position                 */
#define PWM_CFL2_CFL_Msk                 (0xfffful << PWM_CFL2_CFL_Pos)                    /*!< PWM_T::CFL2: CFL Mask                     */

#define PWM_CFL2_CFL_H_Pos               (16)                                              /*!< PWM_T::CFL2: CFL_H Position               */
#define PWM_CFL2_CFL_H_Msk               (0xfffful << PWM_CFL2_CFL_H_Pos)                  /*!< PWM_T::CFL2: CFL_H Mask                   */

#define PWM_CRL3_CRL_Pos                 (0)                                               /*!< PWM_T::CRL3: CRL Position                 */
#define PWM_CRL3_CRL_Msk                 (0xfffful << PWM_CRL3_CRL_Pos)                    /*!< PWM_T::CRL3: CRL Mask                     */

#define PWM_CRL3_CRL_H_Pos               (16)                                              /*!< PWM_T::CRL3: CRL_H Position               */
#define PWM_CRL3_CRL_H_Msk               (0xfffful << PWM_CRL3_CRL_H_Pos)                  /*!< PWM_T::CRL3: CRL_H Mask                   */

#define PWM_CFL3_CFL_Pos                 (0)                                               /*!< PWM_T::CFL3: CFL Position                 */
#define PWM_CFL3_CFL_Msk                 (0xfffful << PWM_CFL3_CFL_Pos)                    /*!< PWM_T::CFL3: CFL Mask                     */

#define PWM_CFL3_CFL_H_Pos               (16)                                              /*!< PWM_T::CFL3: CFL_H Position               */
#define PWM_CFL3_CFL_H_Msk               (0xfffful << PWM_CFL3_CFL_H_Pos)                  /*!< PWM_T::CFL3: CFL_H Mask                   */

#define PWM_PDMACH0_PDMACH01_Pos         (0)                                               /*!< PWM_T::PDMACH0: PDMACH01 Position         */
#define PWM_PDMACH0_PDMACH01_Msk         (0xfful << PWM_PDMACH0_PDMACH01_Pos)              /*!< PWM_T::PDMACH0: PDMACH01 Mask             */

#define PWM_PDMACH0_PDMACH02_Pos         (8)                                               /*!< PWM_T::PDMACH0: PDMACH02 Position         */
#define PWM_PDMACH0_PDMACH02_Msk         (0xfful << PWM_PDMACH0_PDMACH02_Pos)              /*!< PWM_T::PDMACH0: PDMACH02 Mask             */

#define PWM_PDMACH0_PDMACH03_Pos         (16)                                              /*!< PWM_T::PDMACH0: PDMACH03 Position         */
#define PWM_PDMACH0_PDMACH03_Msk         (0xfful << PWM_PDMACH0_PDMACH03_Pos)              /*!< PWM_T::PDMACH0: PDMACH03 Mask             */

#define PWM_PDMACH0_PDMACH04_Pos         (24)                                              /*!< PWM_T::PDMACH0: PDMACH04 Position         */
#define PWM_PDMACH0_PDMACH04_Msk         (0xfful << PWM_PDMACH0_PDMACH04_Pos)              /*!< PWM_T::PDMACH0: PDMACH04 Mask             */

#define PWM_PDMACH2_PDMACH21_Pos         (0)                                               /*!< PWM_T::PDMACH2: PDMACH21 Position         */
#define PWM_PDMACH2_PDMACH21_Msk         (0xfful << PWM_PDMACH2_PDMACH21_Pos)              /*!< PWM_T::PDMACH2: PDMACH21 Mask             */

#define PWM_PDMACH2_PDMACH22_Pos         (8)                                               /*!< PWM_T::PDMACH2: PDMACH22 Position         */
#define PWM_PDMACH2_PDMACH22_Msk         (0xfful << PWM_PDMACH2_PDMACH22_Pos)              /*!< PWM_T::PDMACH2: PDMACH22 Mask             */

#define PWM_PDMACH2_PDMACH23_Pos         (16)                                              /*!< PWM_T::PDMACH2: PDMACH23 Position         */
#define PWM_PDMACH2_PDMACH23_Msk         (0xfful << PWM_PDMACH2_PDMACH23_Pos)              /*!< PWM_T::PDMACH2: PDMACH23 Mask             */

